app/controllers/activity_controller.rb

def create



		if current_user
			@adventures = Adventures.new(:title => params[:title], :Adate => params[:Adate], :desc => params[:desc], :location=> params[:location], :time => params[:time], :created_by => current_user.email )
			@adventures.save
---
INSERT INTO "adventures" ("Adate", "created_at", "created_by", "desc", "location", "time", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)